[
    {
        "id": 1,
        "title": "FDA Takes Steps to Further Harmonize Clinical Research Regulations with HHS Common Rule.",
        "image": "images/blog/blog-01.png",
        "text": "Irin Pervin",
        "largeImage": "images/blog/blog-01.png",
        "author": ["Hilary Marston"],
        "date": "06 Oct 2022",
        "view": "70 views",
        "categories": ["Regulatory", "Quality"],
        "excerpt": "Clinical trials play a crucial role in advancing science and supporting the development of new medical products to address unmet patient needs.",
        "body":  ["<p>Clinical trials play a crucial role in advancing science and supporting the development of new medical products to address unmet patient needs. Reliable data from well-designed trials about a medical product’s safety and effectiveness are critical to the U.S. Food and Drug Administration’s decision-making about a product’s benefits and risks. In general, clinical trials, particularly advanced stage trials, that enroll participants reflecting the diversity of patient populations will help make it possible to apply the findings from clinical trials to broader patient populations and maximize the public health impact of FDA cleared or approved products.These clinical trials are only possible because of the people who volunteer to participate to help find new products to treat, prevent, or diagnose specific medical conditions. The FDA is committed to protecting clinical trial participants and helping to ensure that the clinical research enterprise welcomes a breadth of participants who receive relevant and accessible information about participating. It is with these goals in mind that we approach the modernization of the FDA’s oversight of clinical research and harmonizing with the U.S. Department of Health and Human Service (HHS) Common Rule to make clinical trials more efficient and improve information for potential participants. The Common Rule is a set of federal rules that protect people who participate in research.</p>"],
        "tags": ["Corporate", "Clinical", "Trials", "FDA"]
    },
    {
        "id": 2,
        "title": "Key Points from the FDA’s Guidance for CAR T-Cell Products.",
        "image": "images/blog/blog-02.png",
        "text": "Irin Pervin",
        "largeImage": "images/blog/blog-02.png",
        "author": ["David Pérez, PhD"],
        "date": "06 Sept 2022",
        "view": "70 views",
        "categories": ["Regulatory", "Quality"],
        "excerpt": "A CRO summarizes the FDA’s recommendations for developers and highlights issues that have been raised in public comments.",
        "body":  ["<p>In March 2022, the U.S. Food and Drug Administration (FDA) issued its first draft guidance for industry specifically focused on chimeric antigen receptor (CAR) T-cell therapies.1 CAR T-cell products are T cells that have been genetically modified to express T-cell receptors that can recognize and bind to specific antigens on the surface of target cells (such as cancer cells). When the T-cell receptors engage antigens, they activate the T cells that bear them against the target cells that bear the antigens. In recent years, products of this type have shown unprecedented clinical efficiency, and they have become important tools in the fight against diseases.<br/>Under the FDA framework for biological products, CAR T-cell products have been regulated as gene therapy products. Indeed, CAR T-cell products will continue to be covered by a January 2020 FDA guidance concerning Investigational New Drug (IND) applications for human gene therapy products.2 And now CAR T-cell products will also be covered by the newly issued FDA guidance, which provides CAR T cell–specific recommendations regarding chemistry, manufacturing, and control (CMC); pharmacology and toxicology; and clinical study design. This guidance applies not only to CAR T-cell products, but also to other genetically modified lymphocyte products such as CAR natural killer (NK) cells or T cell receptor–modified T cells <br/>CAR T cells are complex products that can contain multiple functional elements as part of the chimeric construct. The nature of these functional elements, how they are introduced into the cells through a vector, the cellular starting material, and the final drug product formulation are all critical to product safety, specificity, and efficacy. <br/> CAR constructs typically contain two types of domains: antigen recognition domains and signaling domains. The FDA recommends providing an assessment of the ability of each antigen recognition domain to specifically bind to its target molecules. Whenever immunogenicity is reduced (for example, through humanization by complementarity-determining region grafting), the impact on target binding and biological activity should be evaluated.The FDA also recommends that the functionality of signaling domains be thoroughly demonstrated, and that information be provided describing how CAR components (that is, transmembrane domain, hinge region, and linker regions) affect CAR T-cell specificity and activity. Read more <a href='https://www.genengnews.com/topics/bioprocessing/key-points-from-the-fdas-guidance-for-car-t-cell-products/#:~:text=Under%20the%20FDA%20framework%20for,for%20human%20gene%20therapy%20products.'>Here</a> </p>"],
        "tags": ["Corporate", "Clinical", "Trials", "FDA"]
    },
    {
        "id": 3,
        "title": "FDA Takes Steps to Further Harmonize Clinical Research Regulations with HHS Common Rule.",
        "image": "images/blog/blog-01.png",
        "text": "Irin Pervin",
        "largeImage": "images/blog/blog-01.png",
        "author": ["Hilary Marston"],
        "date": "06 Oct 2022",
        "view": "70 views",
        "categories": ["Regulatory", "Quality"],
        "excerpt": "Clinical trials play a crucial role in advancing science and supporting the development of new medical products to address unmet patient needs.",
        "body":  ["<p>Clinical trials play a crucial role in advancing science and supporting the development of new medical products to address unmet patient needs. Reliable data from well-designed trials about a medical product’s safety and effectiveness are critical to the U.S. Food and Drug Administration’s decision-making about a product’s benefits and risks. In general, clinical trials, particularly advanced stage trials, that enroll participants reflecting the diversity of patient populations will help make it possible to apply the findings from clinical trials to broader patient populations and maximize the public health impact of FDA cleared or approved products.These clinical trials are only possible because of the people who volunteer to participate to help find new products to treat, prevent, or diagnose specific medical conditions. The FDA is committed to protecting clinical trial participants and helping to ensure that the clinical research enterprise welcomes a breadth of participants who receive relevant and accessible information about participating. It is with these goals in mind that we approach the modernization of the FDA’s oversight of clinical research and harmonizing with the U.S. Department of Health and Human Service (HHS) Common Rule to make clinical trials more efficient and improve information for potential participants. The Common Rule is a set of federal rules that protect people who participate in research.</p>"],
        "tags": ["Corporate", "Clinical", "Trials", "FDA"]
    }
]

    